{"Address":"410 Terry Avenue North, Seattle, WA, United States, 98109-5210","ForwardAnnualDividendYield":"0","EBITDA":"43707998208","EPS":"34.202","ShortPercentOutstanding":"0.01","ExDividendDate":"None","Name":"Amazon.com, Inc","Beta":"1.198","Industry":"Internet Retail","FiscalYearEnd":"December","EVToEBITDA":"36.2294","AnalystTargetPrice":"3831.77","Currency":"USD","PriceToSalesRatioTTM":"4.8114","52WeekLow":"1626.0318","DilutedEPSTTM":"34.202","QuarterlyEarningsGrowthYOY":"1.924","ProfitMargin":"0.0499","ForwardPE":"61.7284","LastSplitFactor":"2:1","LatestQuarter":"2020-09-30","TrailingPE":"97.7393","RevenueTTM":"347945009152","QuarterlyRevenueGrowthYOY":"0.374","ReturnOnAssetsTTM":"0.0517","Exchange":"NASDAQ","PriceToBookRatio":"19.9563","Country":"USA","MarketCapitalization":"1677293387776","50DayMovingAverage":"3210.0344","52WeekHigh":"3552.25","ReturnOnEquityTTM":"0.2495","PercentInsiders":"14.556","Description":"Amazon.com, Inc. engages in the retail sale of consumer products and subscriptions in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It sells merchandise and content purchased for resale from third-party sellers through physical and online stores. The company also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Rings, and Echo and other devices; provides Kindle Direct Publishing, an online service that allows independent authors and publishers to make their books available in the Kindle Store; and develops and produces media content. In addition, it offers programs that enable sellers to sell their products on its Websites, as well as its stores; and programs that allow authors, musicians, filmmakers, skill and app developers, and others to publish and sell content. Further, the company provides compute, storage, database, and other AWS services, as well as fulfillment, advertising, publishing, and digital content subscriptions. Additionally, it offers Amazon Prime, a membership program, which provides free shipping of various items; access to streaming of movies and TV episodes; and other services. The company also operates in the food delivery business in Bengaluru, India. It serves consumers, sellers, developers, enterprises, and content creators. The company also has utility-scale solar projects in China, Australia, and the United States. Amazon.com, Inc. has a strategic relationship with NXP Semiconductors N.V. to deliver a cloud compute solution for vehicles that enable cloud-powered services. The company was founded in 1994 and is headquartered in Seattle, Washington.","200DayMovingAverage":"3185.174","Symbol":"AMZN","PayoutRatio":"0","SharesShort":"3141707","DividendYield":"0","ShortPercentFloat":"0.0074","FullTimeEmployees":"1125300","DividendDate":"None","EVToRevenue":"4.7852","GrossProfitTTM":"114986000000","OperatingMarginTTM":"0.0572","Sector":"Consumer Cyclical","ShortRatio":"0.86","SharesFloat":"427783024","ForwardAnnualDividendRate":"0","DividendPerShare":"None","PercentInstitutions":"58.663","RevenuePerShareTTM":"696.935","LastSplitDate":"1999-09-02","AssetType":"Common Stock","BookValue":"164.89","PERatio":"97.7393","SharesOutstanding":"500889984","SharesShortPriorMonth":"3293474","PEGRatio":"1.2606"}